Repository: atlas-studios/ForcedExposureDailyAfterRebirth
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 所以影响不多，也没怎么多去注意过这个女生，只是道听途说关于她的黑料倒是不少。
en_us: Hence, Ye Li did not have much of an influence and Cheng Yan never paid much attention to her. She had only heard that there was a lot of controversy about her.

source: 所以很多人可能都来不及准备。
en_us: Many people may not be able to make preparations in time.

source: 所以徐凤年成为继承人，早已是定局。
en_us: Hence, Xu Fengnian's fate as the successor was long sealed.

source: 所以总给人一种很胖的感觉。
en_us: Hence, she often looked really plump.

source: 所以程艳硬是看了半天，才回过神来。
en_us: Hence, Cheng Yan stared at her for a long time before reacting.

source: 所以穿上这夏夜之星后，整个人显得性感又不失高贵。
en_us: Hence, after putting on the Stars of the Summer Night gown, she looked extremely sexy yet still elegant and poised.

source: 所以说她所说的都是真话。
en_us: That meant that everything she said previously was true.

source: 所以说，她是真的穿了人家衣裳，没付钱就拍照，还发微博，最后叶漓买了裙子，才会导致他们产生了这样的误会？
en_us: 'Does that mean that she has really put on the gown and taken a photo without paying for it? She even uploaded it onto Twitter and caused us to misunderstand Ye Li even though Ye Li is the one who bought the gown?'

source: 所以说，是他们误会人家了？
en_us: 'Does that mean that we've misunderstood her?'

source: 所以说，自己重生回到了八年前？
en_us: 'Does this mean that I've been reborn in the year 2020?'

source: 所以谁都不知道，叶漓那厚重刘海下，隐藏着的到底是一张怎样的脸。
en_us: Hence, no one knew that under Ye Li's thick bangs, laid a beautiful face.

source: 所以这也是叶漓为什么要留着厚重刘海的原因。
en_us: That was also the reason Ye Li decided to have thick bangs.

source: 所以这会儿才会在这里等她。
en_us: That was why she waited for her at the door.

source: 所有人的眼里，都没有她的存在。
en_us: In the eyes of everyone, she was almost non-existent.

source: 所有人都叫叶漓大小姐。
en_us: Everyone addressed Ye Li as 'Missy'.

source: 手下的力道越来越紧，突然就打开车门下了车，大步往学校的方向走了进去。
en_us: Tightening his grip on his mobile phone, he suddenly opened the door and got out of the car to stride towards the school.

source: 手机叮咚一声响起。
en_us: Her mobile phone beeped.

source: 手机突然叮咚一声响了起来，她打开一看，是于向阳发来的消息：“鱼庄被人包场了，我这边预约不到，你们来御食坊吧。”
en_us: Her mobile phone suddenly beeped and she unlocked it to see that she had received a text message from Yu Xiangyang. "The fish restaurant has been booked by someone else. I couldn't make a reservation. Come to Imperial Restaurant instead."

source: 才短短一天的时间，他所有的行程被公司取消，一个当红偶像，却差点就落到了被雪藏的地步，他自然是坐不住，打听到了叶枫回家的消息，立即就赶了过来，打算找叶漓道个歉，求原谅。
en_us: In just one day, all his itineraries and events were canceled by his management agency. As a famous idol, he actually almost fell to the point of being boycotted. He naturally couldn't sit back and accept it. Hence, after finding out that Ye Feng had returned home, he immediately rushed over in a bid to apologize to Ye Li and seek forgiveness.

source: 抬眼可见，遍地豪车。
en_us: There were luxury cars everywhere.

source: 抬眼看人，却又清冷的令人不敢与之对视。
en_us: However, when she looked up, the look in her eyes was was cold and daunting. They did not dare to look at her at all.

source: 拆开，里面正是那条夏夜之星礼服。
en_us: She removed the lid of the box to reveal the Stars of the Summer Night gown.

source: 拥有这么可盐可甜的宝藏哥哥，真是她两辈子最大的幸运。
en_us: She was truly lucky to have her precious brothers who could be cool yet sweet.

source: 按照平时的情况，如今这会儿被骂的人不应该是叶漓才对吗？
en_us: Usually, Ye Li would be the one getting rebuked by everyone.

source: 按照平时，这丫头看到他们，不应该是大吵大闹的叫滚？
en_us: Ye Li would usually throw a huge tantrum and tell them to get lost whenever she saw them.

source: 换做上辈子的叶漓听这话，估摸着赶紧就把头发给拉下来了。
en_us: If Ye Li were to hear those words in her previous life, she would have quickly pulled her hair down.

source: 换做平时，几个大男人可能还会觉得她可怜。
en_us: Usually, the men might still feel sorry for her.

source: 换做是上辈子的叶漓，估摸着心里早就欣喜万分了。
en_us: In her previous life, Ye Li would have probably been on cloud nine.

source: 换做是以前的叶漓，她哪里有这个胆子？
en_us: 'How would the old Ye Li dare to do this?'

source: 换做是别人，遇到这种情况，恐怕早就吓傻了。
en_us: Anyone else in Ye Li's position would have been frightened out of their wits if they were to encounter such a situation.

source: 掌心发麻。
en_us: Her palm turned numb.

source: 接下来，她会更难看。
en_us: Ye Mei would be having it worse in time to come.

source: 收回之前对叶漓的看法，眼前这个女孩，远远超出了她所了解的范围。
en_us: Putting aside the initial impression that she had of Ye Li, she felt that the girl was far beyond what she understood.

source: 收拾好了东西，随便穿了一身连衣裙就背着书包下了楼。
en_us: After packing up, she casually put on a dress and made her way downstairs with her schoolbag.

source: 放他鸽子？
en_us: 'Is she standing me up?'

source: 教学这么多年，她还是头一次被一个学生威胁至此。
en_us: In all the years of her career as a teacher, it was the first time she had been threatened by a student like this.

source: 整个人一僵。
en_us: She was dumbfounded and she froze.

source: 整个人摇摇欲坠不可置信的看着她。
en_us: She was swaying unsteadily and looking at her in disbelief.

source: 文艺女神？
en_us: 'Goddess of the Arts?'

source: 无数名媛千金挤破了脑袋也想接触的对象。
en_us: Countless socialites and heiresses desperately wanted to get close to him.

source: 无数的消息瞬间跳了出来。
en_us: Countless notifications appeared immediately.

source: 无数营销号也在一夜之间冒出，开始各种传播叶漓和枫神的关系。
en_us: Countless marketing accounts also popped up overnight and began spreading the news about Ye Feng's relationship with Ye Li.

source: 无论是贴吧，还是微博，还是社交圈子，都被这门话题刷屏。
en_us: That topic was on the front page of all social media platforms like Twitter and Reddit.

source: 无论是颜值性格还是身材，她都排不上号。
en_us: She was not qualified to be on the ranks, be it in terms of looks or figure.

source: 无限刷的黑卡，里面的钱肯定够她买那条裙子。
en_us: A black card with no credit limit would definitely be sufficient for her to buy that dress.

source: 明明之前还不过是一个普通的不能再普通的女孩子，可现在只是换了个发型，给人的感觉就不一样了
en_us: Previously, she was just an extremely ordinary plain Jane but she gave off a drastically different vibe after changing her hairstyle.

source: 明明今天之前，她比谁都讨厌徐凤年。
en_us: She clearly hated Xu Fengnian more than anyone else did before today.

source: 明明刚刚就没有要挽留自己的意思，这会儿突然就改变主意了。
en_us: 'She clearly didn't intend to make me stay just now. Why did she suddenly change her mind?'

source: 明明只要稍微放软一点态度，哥哥们都恨不得将全世界献到你的面前，你为什么还要那样寒他们的心。
en_us: 'As long as you soften your attitude, your brothers would clearly give you anything you want. Why did you have to disappoint them that way?'

source: 明明叶漓刚刚那话就是在骂她眼光差，说她连个中年男人都不如，偏偏又用这种开玩笑的语气，司机还以为真是玩笑，可叶眉却感觉，叶漓就是故意的。
en_us: Ye Li was clearly criticizing her for her poor taste just now and even said that her taste was worse than that of a middle-aged man. Yet, she made it sound light-hearted and even the chauffeur thought it was a joke. However, Ye Mei felt that she had done it on purpose.

source: 明明是个小辈，可二夫人从未看懂过这个侄子的心思。
en_us: He was clearly a junior but Kong Yun had never been able to see through her nephew.

source: 明明是自己来买礼服的，可自己想要的没买到，倒是多花了几百万，叶眉心里几欲吐血。
en_us: Ye Mei was supposedly there to buy a gown for herself but in the end, she did not end up getting any and ended up spending almost a million dollars for nothing.

source: 明明自己也是爸爸的女儿，为什么要这么偏心。
en_us: 'I'm clearly Father's daughter too. Why are they so biased towards me?'

source: 是了， 以往叶眉和叶漓关系最好，即使在叶漓被外面的人骂成那般，她也毅然站在自家姐姐身边，这样的作为可没少被人夸赞情深意切。
en_us: Yeah, in the best, Ye Li and Ye Mei were the closest to each other and even when Ye Li was criticized by others, she would still stand on her sister's side. Hence, her behavior won her many praises for being loyal to her sister.

source: 是叶眉那样说，才给他们那种叶漓好像是逼她离开的感觉。
en_us: They were only misled into thinking that Ye Li was forcing her to leave because of Ye Mei's words.

source: 是啊，叶漓不承认这件事是她的错的话，大家也不会怎么多想，毕竟没有人知道她到底是不是因为于向阳自杀，所以也不会多在意这件事。
en_us: Yeah, if Ye Li did not admit that it was her fault, everyone else wouldn't think that way either. After all, no one knew if she had really tried to kill herself because of Yu Xiangyang. Hence, they wouldn't bother too much about that matter.

source: 是因为自己之前的拒绝，所以她才会这样吗?
en_us: 'Is she acting like this because I turned her down previously?'

source: 是觉得换这样的方式，就能吸引他的注意了？
en_us: 'Does she think that she can attract my attention by using another method?'

source: 是那么的熟悉，她一下就惊在了原地。
en_us: Their faces were so familiar that she immediately froze on the spot.

source: 晚上要去参加徐家的聚会。
en_us: They were going to attend the social gathering hosted by the Xu Family in the evening.

source: 暗想难不成就是之前大家传的那个包养叶漓的对象？
en_us: They secretly wondered if it was the man who was rumored to be Ye Li's sugar daddy.

source: 更别提他向自己示软。
en_us: Not to mention, he had nwow mellowed down and treated her less harshly.

source: 更别说之前两人还是出了名的好兄弟。
en_us: Moreover, the two were known to be best buddies in the past.

source: 更别说好好说句话。
en_us: She obviously wouldn't speak to them nicely.

source: 更别说现在叶漓还没嫁进来呢。
en_us: Besides, Ye Li had yet to marry Xu Fengnian.

source: 更别说这里不仅有叶家的几个兄弟，还有着徐家其他旁系。
en_us: Besides, Ye Luo and his brothers were not the only ones there, the other distant relatives of the Xu Family were present too.

source: 更别说，这还是胆小鬼叶漓！
en_us: Moreover, she was Ye Li, who was known to be a wimp.

source: 更被说还是叶漓这种爱面子的人。
en_us: Besides, Ye Li was a prideful person.

source: 曾利用自己和她的关系，害她做了不少伤害了徐凤年的事。
en_us: She once took advantage of her close relationship to Ye Li to make the latter do many things to hrm Xu Fengnian in the past.

source: 曾还被人拍摄到她和徐凤年的照片上过八卦新闻。
en_us: Someone had even taken photos of her and Xu Fengnian, which were published on the tabloids.

source: 最令人惊悚的是，自己刚刚还差点同意了退学的处罚。
en_us: The most frightening thing was that the principal almost agreed to expel her.

source: 最前面坐着的男人，正拿着文件看着，另一只指节分明的手指有节奏的在桌上有一下没一下的敲击，每一声仿佛都敲在了众公司高层的心上，众人秉着呼吸，大气也不敢喘上半分。
en_us: The man seated right in front was reading a document in his hand while tapping his other hand, which had well-defined knuckles, against the table rhythmically every now and then. Every knock seemed to be landing on the hearts of the various senior executives of the company. Everyone in the room was holding their breaths, and no one dared not breathe loudly at all.

source: 最前面的的位置上，坐着一个头发花白，戴着眼镜，穿着中山装模样威严的老头。
en_us: The one seated in front was a domineering, majestic-looking and bespectacled old man who was wearing a traditional Chinese attire.

source: 最近ys出了一款限定夏夜之星的裙子，听说能在灯光下闪闪发光，若是能买到手，绝对会成为宴会最耀眼的存在。
en_us: Recently, a certain luxury fashion brand had released a limited edition dress named "The Stars of the Summer Night" which would apparently glisten under the light. If Ye Mei could get her hands on it, she would definitely steal the limelight at the gathering.

source: 有人惊呼出声。
en_us: Someone exclaimed in surprise.

source: 有人惋惜。
en_us: Some people found it a pity and lamented.

source: 有人擦了擦冷汗。
en_us: Some of them wiped away their cold sweat.

source: 有人确定道。
en_us: Someone said firmly.

source: 有人突然惊讶的猜测。
en_us: Someone suddenly guessed in surprise.

source: 有人突然说了这么一句，接着，大家纷纷仔细打量起了叶漓过来，“没错，就是她，虽然图片有些模糊，但是肯定就是她！”
en_us: Someone suddenly said that, after which they all began to scrutinize Ye Li carefully. "Yeah, it's her. The pictures may be blurry but it's definitely her!"

source: 有人这么一说，其他人顿时反应了过啦。
en_us: As soon as someone said that, everyons suddenly realized something.

source: 有人骂，但是很快就被各种歉意的声音掩盖。
en_us: Some were still lashing out at Ye Li but their comments were soon hidden by various apologies.

source: 有什么事情不能好好说吗？
en_us: They felt that she could have talked things out with them properly.

source: 有时候十天半个月也不会来，有时候一来就是一个月。
en_us: Sometimes he wouldn't come for 10 days or half a month, sometimes, he would attend school consistently for a month.

source: 有钱人家的孩子她针对不起，一般人家的她还怕？
en_us: 'I may not be able to offend and provoke the wealthy children but I'm not afraid of kids from ordinary families at all.'

source: 服务员尊敬的道。
en_us: The sales assistant said respectfully.

source: 未加入徐家之前，她曾是娱乐圈有名的歌后。
en_us: Before she married into the Xu Family, she was a famous singer in the entertainment industry.

source: 本以为她的脸色会非常难看，可他想错了。
en_us: He thought that she would seem very upset but he had assumed wrongly.

source: 本以为这件事会告吹，谁料没多久，就传来了叶家同意联姻的消息。
en_us: She thought that the matter would fall through, but to her surprise, the news of the Ye Family agreeing to it, begun to spread.

source: 本来不想来参加这种无聊的聚会。
en_us: She initially did not want to come to such a boring gathering.

source: 本来之前徐晗帮叶漓说话的时候，就已经得罪了全班一半的女孩子，这会儿还在网上刷到了她跟她们男神吃饭的八卦新闻，谁还忍得住，这会儿看她的目光像是要吃人。
en_us: When Xu Han spoke up for Ye Li previously, she had already offended half of the girls in the class, and now they saw the news of her having lunch with their idol on the internet. They obviously couldn't tolerate it at all and at this moment, they were looking at her like they were about to eat her up.

source: 本来今天是准备邀请她吃饭，求原谅的。
en_us: He was initially ready to ask her out to lunch and ask for forgiveness.

source: 本来他是没想这么搞的，毕竟之前包场的时候，没人知道是自己。
en_us: Initially, he did not plan to do that. After all, no one knew that he was the one who had booked the restaurant previously.

source: 本来只是听说没有得到实证的众人一听这话，对叶漓更是鄙夷。
en_us: Those people who had only heard those rumors based on hearsay and did not have concrete evidence, were filled with disdain towards Ye Li after hearing those words.

source: 本来就很不甘心，当看到枫神邀请的叶漓吃饭的时候，更是眼红的不行。
en_us: They were initially already feeling indignant but when they saw Ye Feng inviting Ye Li to lunch, they felt even more jealous.

source: 本来想着这件事若是叶眉能配合，他们ys这边也就不追究了。
en_us: The authorities of YS Fashion initially thought that they would stop pursuing the matter if Ye Mei was cooperative.

source: 本来气势汹汹过来找茬的叶眉粉丝，看到这突然冒出来才致歉微博，也是呆了。
en_us: Ye Mei's fans who were slamming Ye Li harshly just now were dumbfounded to see the apology made by the fashion label on Twitter.

source: 本来的等着她发火的叶眉一下就愣住了。
en_us: Ye Mei, who was initially waiting for her to lose her temper, was stunned.

source: 本来看到这件事的时候，作为粉丝的她们是十分愤怒的。
en_us: As fans of Ye Feng, they were originally extremely infuriated when they saw what happened.

source: 本来看叶眉这不要脸的欲语还休的模样，她心里是很不舒服的。
en_us: Ye Li was initially displeased to see how shameless Ye Mei was when she was trying to speak to Xu Fengnian.

source: 本来老师都不想多说什么，可听叶眉这话，顿时就更不舒服了：“扫个地也算是粗活？千金小姐也没这么娇气吧？”
en_us: Initially, Cheng Yan did not want to comment any further but she felt even more irked after hearing Ye Mei's words. "Sweeping the floor is considered hard labor too? Even heiresses of wealthy families are not that spoiled, are they?"

source: 本来还在讨论枫神的妹妹们是如何如何的丑，如何如何的吓人的粉丝们看到这条微博，顿时哑然。
en_us: The fans who were discussing how ugly and frightening Ye Li's appearance was, were immediately stunned speechless when they saw her tweet.

source: 本来还有些不爽的叶漓听到这些直言直语，差点没忍住喷笑。
en_us: Ye Li, who was initially displeased with Wen Ya's straightforwardness, almost burst into laughter.

source: 本来还议论纷纷的众人听叶漓这话，也是一下禁了声，纷纷倒退了几步，生怕自己会被殃及。
en_us: Those who were initially still discussing immediately fell silent after hearing Ye Li's words and they took a few steps back one after another, for fear that they would be implicated.

source: 本来都打算上前制止，谁料竟然会发生了这样巨大的转折。
en_us: He initially planned to step forth to stop them but to his surprise, a major twist happened.

source: 来来往往的同学们，吵闹纷纷。
en_us: The students coming and going were noisy and boisterous.

source: 来的人肯定都是各种豪门千金，穿着打扮势必顶尖，叶眉可不想被那些人比下去！
en_us: The guests who would show up there were mostly daughters of wealthy families who would be dressed opulently. Ye Mei did not want to seem inferior to them!

source: 果然！
en_us: Just as she expected!

source: 果然，叶眉的目的确实是借钱。
en_us: Indeed, Ye Mei's ulterior motive was to borrow money from her.

source: 果然，大家听完，看叶漓的表情都充满了鄙夷之色。
en_us: As expected, after everyone heard their words, they looked at Ye Li in contempt.

source: 果然，徐家只有一个徐大少，叶家也是三兄弟，本来皆大欢喜，结果这个时候，叶家夫人又怀上了，而且还是个女娃子。
en_us: The Xu Family only had one son while the Ye Family had three, which was a joyous affair for everyone. However, at this juncture, the matriarch of the Ye Family got pregnant again with a baby girl.

source: 果然，这话一出，徐凤年脸上的笑容就消失了。
en_us: Just as she expected, the smile on Xu Fengnian's face disappeared as soon as she said those words.

source: 果然，那边的叶洛一听，心里顿时就不是滋味，“你说阿漓找你吃的饭？”
en_us: Just as he expected, Ye Luo was upset after hearing his words. "You said that Ye Li asked you out for lunch?"

source: 果然，高定的礼服就是不一样，瞬间就吸引了众人艳羡的目光。
en_us: As expected, a high-end luxurious gown was just different from the others. It immediately attracted the envious gazes of the people around her.

source: 枫神&向阳等于真爱：“叶漓是什么东西，竟让敢插入我们枫神和向阳，真是不要脸，我们风向cp绝对不会放过她的。”
en_us: Ye Feng and Xiangyang Equal To True Love: "Who is Ye Li? How dare she intervene in the relationship between Ye Feng and Xiangyang? How shameless. We ship Ye Feng and Xiangyang together. We will never let her off."

source: 枫神我爱你：“不可能，我不相信，这不是真的！”
en_us: Ye Feng I Love You: "Impossible, I don't believe it, it's not true!"

source: 枫神甚至都没看其他人一眼，就领着叶漓朝着鱼庄走去。
en_us: Ye Feng led Ye Li to the fish restaurant without looking at anyone else.

source: 校长一噎。
en_us: The principal choked.

source: 校长不得不出面处理此事。
en_us: The principal had to step in to handle the matter.

source: 校长也没想到叶漓说话和长相竟然这么不符，完全就是一混世魔王的性子，颇为头疼的道：“你们看看要怎么解决这件事，说出来大家才好决定啊。”
en_us: The principal did not expect Ye Li to behave so differently from the way she looked. She was just like a demon. Feeling a huge headache, he said, "Think about how you're going to settle this and tell us what you have in mind. That would make it easier for us to come to a decision."

source: 校长倒是没想到这一家人一个比一个毒。
en_us: The principal did not expect them to be so vicious.

source: 校长剧烈咳嗽一声。
en_us: The principal coughed violently.

source: 校长看到这一幕，也是颇为无奈的摇了摇头，这孟父还真是不会看人脸色，叶枫来了之后，他直接就不敢插手此事，还一直用眼神暗示他别招惹。
en_us: When the principal saw that, he shook his head helplessly and thought to himself, 'Meng Fei's father is really so insensitive.' After Ye Feng arrived, the principal dared not intervene in the matter further and even shot him a hinting glance to signal him not to provoke Ye Feng.

source: 校长脊背一阵发凉，只觉得自己这个位置要不保了。
en_us: The principal felt a chill down his spine and felt that he was going to lose his job.

source: 校长还没来得及反应，门就已经被人推了开，来人穿着一身休闲装，一头蓝色的头发有些凌乱，却又不失帅气，可能是因为着急，这会儿还喘着粗气，脸色也很是难看。
en_us: Before the principal reacted, the door was already pushed open by someone who was dressed in a casual outfit. Although his blue hair was a little messy, he was still as handsome as ever. Perhaps because he was in a hurry, he was still breathing heavily at this moment with a sullen expression.

source: 校长这话让孟父以为，他是将叶漓交给他们处理了，于是冷哼了一声，看向了孟非问：“女儿，你想怎么处置她！”
en_us: The principal's words made Meng Fei's father think that he had allowed them to discipline Ye Li however they wanted. Hence, he humphed coldly and looked at Meng Fei. "Daughter, what do you want to do about her!?"

source: 校长闻言，顿时为难了起来，叶漓这么笃定，那肯定说的不是假话。
en_us: The principal was stuck in a dilemma immediately after hearing her words. Since Ye Li was so calm, he thought that she was definitely not lying.

source: 校长闻言，顿时犹豫了起来。
en_us: The principal immediately began to hesitate after hearing her words.

source: 校长顿时冷汗直冒。
en_us: The principal immediately broke out in cold sweat.

source: 桌上的叶眉也穿着同样的校服。
en_us: Seated by the table, Ye Mei was also dressed in the same school uniform.

source: 梦梦仙女：“美女姐姐，想问一下叶漓真的是你的姐姐吗？请问一下这件事到底是什么情况，你能否剧透一下？”
en_us: Dreamy Fairy: "Pretty girl, may I ask if Ye Li is really your elder sister? What exactly happened? Could you reveal some details?"

source: 楚楚可怜回复真爱永恒：“我我我，算我一个！”
en_us: Replying to Pitiful, Eternal True Love: "Me, me, me, count me in!"

source: 楚楚回复梦梦仙女：“这里是眉宝的地盘，做错事的是叶漓，请不要再拿这件事来问我们宝了好吗，还我们一片净土。”
en_us: Replying to Dreamy Fairy, Chuchu: "This is Ye Mei's turf, Ye Li was the one who made the mistake, so stop asking our precious gem about this, okay? Let us have some peace."

source: 楚楚：“眉宝都这么说了，肯定没关系，说不定那个叶漓就是故意蹭热度。”
en_us: Chuchu: "Since baby Ye Mei has already said that, there definitely isn't anything between them. Maybe, Ye Li is just deliberately trying to use him for some fame."

source: 楼下，叶眉母女正安静的坐在沙发上。
en_us: Ye Mei and her mother were seated quietly on the couch downstairs.

source: 欲擒故纵？
en_us: 'Play hard to get?'

source: 欺负自家妹妹的竟然不止是外人。
en_us: It turned out that outsiders were not the only ones who were bullying their younger sister.

source: 歉声很多。
en_us: There were numerous apologies.

source: 正在几人偷偷议论之时，就见那女孩从兜里掏出了一颗棒棒糖含在口中，随后她突然抬眸，眼尾上挑，突然就看向了他们的方向。
en_us: While the few of them were secretly discussing amongst themselves, Ye Li took out a lollipop from her pocket and put it in her mouth. She then suddenly looked up and looked in their direction, lifting the corners of her eye.

source: 正当几人准备好跑路的时候，突见那女生只是扫了他们一眼，蹙了蹙眉，便收回了目光，随后背着书包进了学校。
en_us: Just as the few of them were getting ready to flee, they suddenly Ye Li frowning and looking away after just taking a glance at them. She then carried her bag and left the school.

source: 正懊恼着，突听下面同学躁动。
en_us: While she was feeling annoyed and perturbed, she suddenly heard the students getting into an uproar.

source: 正是随后跟来的二夫人和徐媛。
en_us: They were Kong Yun and Xu Yuan.

source: 正欲发微博埋怨一下，可当看到那无数的骂声时，都愣住了。
en_us: Just as she was about to air her woes on Twitter, she was shocked speechless when she saw the countless malicious comments about her on Twitter.

source: 正说着悄悄话，又走进来两人。
en_us: While they were whispering to each other, two more people entered.

source: 此人正是徐家二夫人，孔云。
en_us: She was Kong Yun, the wife of the second son of the Xu Family.

source: 歪头看了看女孩。
en_us: He tilted his head and looked at her.

source: 每次听着，她心里的怨恨都会更深一层。
en_us: Whenever she heard them,she would be overwhelmed with anger and resentment.

source: 比起重生回来的时候，瘦了六斤。
en_us: She had lost a total of three kilograms ever since her rebirth.

source: 毕竟两人还没结婚...
en_us: 'After all, we aren't married yet...'

source: 毕竟之前自己对他的态度。
en_us: After all, she used to be hostile towards him.

source: 毕竟之前那个长时间低着头走路的女孩，和如今这昂首挺胸，叼着根棒棒糖，一脸放荡不羁的女孩子相比，实在是一个天地的差距。
en_us: After all, she used to walk with her head hung low. Yet, she was now walking with her head held high, a lollipop in her mouth, and a nonchalant expression. She was really worlds apart as compared to before.

source: 毕竟于向阳稍稍对她露出一丝温柔，她都能开心上好几天。
en_us: After all, she would be elated for days whenever Yu Xiangyang showed her the slightest gentleness in the past.

source: 毕竟叶眉乖巧可人的形象已经深入人心，没有谁可能怀疑她。
en_us: After all, Ye Mei's obedient and adorable image had been been deeply etched in their minds and no one would suspect her.

source: 毕竟是自己喜欢了这么久的女神，大多数粉丝还是愿意相信她的。
en_us: After all, they had idolized her for a long time, so many of her fans still chose to believe her.

source: 毕竟自己还只是个学生。
en_us: After all, she was just a student.

source: 毕竟还没见谁能从导师办公室出来，还能这么淡定的。
en_us: After all, they had never seen anyone who could remain as calm as her after leaving the teacher's office.

source: 毕竟这个时候，于向阳还是他的好兄弟。
en_us: After all, at this juncture, Yu Xiangyang was still his close friend.

source: 毕竟这关乎孩子未来前尘。
en_us: After all, it concerned her future.

source: 毛病。
en_us: 'He's sick.'

source: 没一会，她又回来了。
en_us: Soon, she returned again.

source: 没一会，程艳恶狠狠的走了过来，怒吼了一声：“叶漓，你跟我出来！”
en_us: Soon, Cheng Yan stomped towards them fiercely and hollered in exasperation, "Ye Li, come out!"

source: 没想到会被她反嘲讽一番。
en_us: She did not expect to be mocked back by Ye Li instead.

source: 没想到徐凤年会突然开口。
en_us: She did not expect Xu Fengnian to interject.

source: 没想到这小胖刘海下面，竟然藏着这么一双漂亮的眼睛。
en_us: He did not expect there to be such a beautiful pair of eyes hiding beneath her bangs.

source: 没想到那么难相处的徐晗，竟然还有着这么性格热情的妹妹。
en_us: She never thought that Xu Han, who was so difficult to get along with, would have such a friendly sister.

source: 没有人给自己送礼物。
en_us: No one gave her any gifts at all, let alone a black card!

source: 没有回答她的话，因为叶漓知道，只要叶眉一找上门，就是带有目的性的。
en_us: Ye Li did not answer her question because she knew that Ye Mei had an ulterior motive.

source: 没有看到自己想看的人之后，失望的收回了目光，看向服务员：“那款还有吗？”
en_us: After realizing that the person he wanted to see was not around, he looked away with disappointment. He then asked the sales assistant, "Is that one still available?"
